<template>
  <div class="PrivacyPage">
    <button class="Button Button--rounded Button--defaultSize PrivacyPage__closeButton" @click="goBack">
      <i class="far fa-arrow-left CloseButtonIcon"></i>
    </button>
    <h2 class="Block__title Block__title--default">
      <div class="Block__titleWrap">Политика конфиденциальности</div>
    </h2>

    <div class="Block__content">
      <section>
        <h2>1. Основные понятия</h2>
        <p><strong>1.1. Сайт</strong> – интернет-магазин воздушных шаров "Подарокк", доступный через сайт <a
            href="https://shariki-v-permi.ru">shariki-v-permi.ru</a> и мобильную версию сайта.</p>
        <p><strong>1.2. Оператор персональных данных (Оператор)</strong> – ИП Золотарёва Е.Ю., Пермь, Тургенева, 21,
          лицо, осуществляющее обработку персональных данных Пользователя в соответствии с условиями настоящей Политики.
        </p>
        <p><strong>1.3. Пользователь</strong> – физическое лицо, использующее Сайт и предоставляющее Оператору свои
          персональные данные в процессе взаимодействия с Сайтом.</p>
        <p><strong>1.4. Политика</strong> – настоящая Политика конфиденциальности, регулирующая порядок обработки и
          защиты персональных данных Пользователей.</p>
      </section>

      <section>
        <h2>2. Общие положения</h2>
        <p>2.1. Настоящая Политика является официальным документом Оператора и определяет порядок обработки и защиты
          информации о Пользователях.</p>
        <p>2.2. Целью настоящей Политики является обеспечение надлежащей защиты информации о Пользователях, в том числе
          их персональных данных, от несанкционированного доступа и разглашения.</p>
        <p>2.3. Отношения, связанные со сбором, хранением, распространением и защитой информации о Пользователях,
          регулируются настоящей Политикой и действующим российским законодательством.</p>
        <p>2.4. Оператор вправе в любой момент вносить изменения в настоящую Политику. Обновленная версия Политики будет
          опубликована на Сайте. Рекомендуется регулярно проверять актуальность Политики.</p>
        <p>2.5. Пользователь выражает свое согласие с условиями настоящей Политики при нажатии кнопки «Оставить заявку»
          на странице сбора данных Пользователя Оператором по адресу <a href="https://shariki-v-permi.ru">shariki-v-permi.ru</a>.
        </p>
      </section>

      <section>
        <h2>3. Условия использования Сайта</h2>
        <p>3.1. Оказывая услуги по использованию Приложений, Оператор, действуя разумно и добросовестно, считает, что
          Пользователь:<br/>
          – обладает всеми необходимыми правами, позволяющими ему принять условия настоящей Политики.<br/>
          – указывает достоверную информацию о себе в объемах, предусмотренных настоящей Политикой;<br/>
          – ознакомлен с настоящей Политикой, выражает свое согласие с ней и принимает на себя указанные в ней права и
          обязанности.</p>
        <p>3.2. Оператор не проверяет достоверность предоставленных Пользователем данных.</p>
      </section>

      <section>
        <h2>4. Цель обработки информации</h2>
        <p>Оператор осуществляет обработку предоставленных Пользователем персональных данных для следующих целей:</p>
        <ul>
          <li>Обработка заявок на товары/услуги;</li>
          <li>Связь с Пользователем по вопросам исполнения заявки.</li>
        </ul>
      </section>

      <section>
        <h2>5. Состав информации о Пользователях</h2>
        <p>Оператор обрабатывает следующие персональные данные Пользователя:</p>
        <ol>
          <li>Имя;</li>
          <li>Номер телефона;</li>
          <li>Электронная почта.</li>
        </ol>
      </section>

      <section>
        <h2>6. Обработка персональных данных</h2>
        <p>6.1. Оператор осуществляет обработку персональных данных на основании принципов:</p>
        <ol>
          <li>законности целей и способов обработки персональных данных и добросовестности;</li>
          <li>соответствия целей обработки персональных данных целям, заранее определенным и заявленным при сборе
            персональных данных, а также полномочиям Оператора;
          </li>
          <li>соответствия объема и характера обрабатываемых персональных данных, способов обработки персональных данных
            целям обработки персональных данных;
          </li>
          <li>недопустимости объединения созданных для несовместимых между собой целей баз данных, содержащих
            персональные данные.
          </li>
        </ol>

        <p>6.2. Условия и цели обработки персональных и иных данных<br/>
          Оператор осуществляет обработку персональных данных Пользователя с его согласия, предусмотренного п.6.3.
          настоящей Политики, в целях, определенных п. 4 настоящей Политики.</p>
        <p>6.3. Согласие на обработку персональных данных<br/>
          Пользователь предоставляет Оператору согласие на обработку своих персональных данных, предусмотренных пунктом
          5.1 настоящей Политики,
          с согласия Пользователя в форме конклюдентного действия – при заполнении данных и нажатии кнопки «Оставить
          заявку» на странице сбора данных Пользователя Оператором по адресу <a href="https://shariki-v-permi.ru">shariki-v-permi.ru</a>.
        </p>
        <p>6.4. Передача персональных данных<br/>
          Персональные данные Пользователей ни при каких условиях не передаются Оператором каким-либо третьим лицам, за
          исключением случаев исполнения Оператором требований действующего российского законодательства.</p>
        <p>6.5. Хранение персональных данных Пользователя осуществляется в течение 14 (четырнадцати) календарных дней с
          даты их предоставления Пользователем, но в любом случае не позднее момента достижения цели, предусмотренной п.
          4 настоящей Политики.</p>
      </section>

      <section>
        <h2>7. Права и обязанности Пользователя</h2>
        <p>Пользователь вправе на основании запроса получать от Оператора информацию, касающуюся обработки его
          персональных данных.</p>
      </section>

      <section>
        <h2>8. Меры по защите информации</h2>
        <p>Оператор принимает технические и организационные меры в целях обеспечения защиты персональных данных
          Пользователя от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования,
          копирования, распространения, а также от иных неправомерных действий.</p>
      </section>

      <section>
        <h2>9. Обращения Пользователей</h2>
        <p>9.1. Пользователь вправе направлять Оператору свои запросы, в том числе запросы относительно использования
          его персональных данных,
          предусмотренных п. 5.1 настоящей Политики, в письменной форме по адресу Оператора, указанному в п. 1.3
          настоящей Политики, или посредством направления электронного письма на адрес электронной почты Оператора
          podarokk.perm@gmail.com.</p>
        <p>9.2. Запрос, направляемый Пользователем, должен содержать следующую информацию:
          <ul>
            <li>номер основного документа, удостоверяющего личность Пользователя или его представителя;</li>
            <li>сведения о дате выдачи указанного документа и выдавшем его органе;</li>
            <li>сведения, подтверждающие участие Пользователя в отношениях с Оператором (в частности, данные,
              предоставленные Пользователем Оператору, предусмотренные п. 5.1 настоящей Политики);
            </li>
            <li>подпись Пользователя или его представителя.</li>
          </ul>
        </p>
        <p>9.3. Оператор обязуется рассмотреть и направить ответ на поступивший запрос Пользователя в течение 30 дней с
          момента поступления обращения.</p>
        <p>9.4. Вся корреспонденция, полученная Оператором от Пользователей (обращения в письменной или электронной
          форме),
          относится к информации ограниченного доступа и не разглашается без письменного согласия Пользователя.
          Персональные данные и иная информация о Пользователе, направившем запрос, не могут быть без специального
          согласия Пользователя использованы иначе, как для ответа по теме полученного запроса или в случаях, прямо
          предусмотренных законодательством.</p>
      </section>
    </div>
  </div>
</template>

<script setup>
import { useRouter } from 'vue-router'
const router = useRouter()
const goBack = () => {
  router.back()
}
</script>

<style scoped lang="scss">
.PrivacyPage {
  min-height: 100vh;
  padding: 100px 20px 30px 20px;

  &__closeButton {
    position: absolute;
    left: -5px;
    top: 87px;
    display: inline-flex;
    align-items: center;
    justify-content: center;
    background: 0 0;
    width: 56px;
    height: 56px;
    cursor: pointer;
    z-index: 1;
  }
}

h1 {
  text-align: center;
  font-size: 24px;
  margin-bottom: 20px;
}

section {
  margin-bottom: 20px;
}

section h2 {
  font-size: 18px;
  margin-bottom: 10px;
}

ul {
  margin-left: 20px;
}

ul li {
  margin-bottom: 5px;
}

a {
  color: #007bff;
  text-decoration: none;
}

a:hover {
  text-decoration: underline;
}

@media (min-width: 1000px) {
  .PrivacyPage {
    padding: 120px 100px 0 100px;

    &__closeButton {
      left: 25px;
      top: 115px;
    }

    &__textBlock {
      margin-bottom: 32px;
    }
  }
}
</style>
