<template>
  <div class="PrivacyPage">
    <button class="Button Button--rounded Button--defaultSize PrivacyPage__closeButton" @click="goBack">
      <i class="far fa-arrow-left CloseButtonIcon"></i>
    </button>
    <h2 class="Block__title Block__title--default">
      <div class="Block__titleWrap">Политика конфиденциальности</div>
    </h2>

    <div class="Block__content">
      <section>
        <h2>1. Основные понятия</h2>
        <p><strong>1.1. Сайт</strong> – интернет-магазин воздушных шаров "Подарокк", доступный через сайт <a href="http://example.com">example.com</a> и мобильную версию сайта.</p>
        <p><strong>1.2. Оператор персональных данных (Оператор)</strong> – ИП Золотарёва Е.Ю., Пермь, Тургенева, 21, лицо, осуществляющее обработку персональных данных Пользователя в соответствии с условиями настоящей Политики.</p>
        <p><strong>1.3. Пользователь</strong> – физическое лицо, использующее Сайт и предоставляющее Оператору свои персональные данные в процессе взаимодействия с Сайтом.</p>
        <p><strong>1.4. Политика</strong> – настоящая Политика конфиденциальности, регулирующая порядок обработки и защиты персональных данных Пользователей.</p>
      </section>

      <section>
        <h2>2. Общие положения</h2>
        <p>2.1. Настоящая Политика является официальным документом Оператора и определяет порядок обработки и защиты информации о Пользователях.</p>
        <p>2.2. Целью настоящей Политики является обеспечение надлежащей защиты информации о Пользователях, в том числе их персональных данных, от несанкционированного доступа и разглашения.</p>
        <p>2.3. Отношения, связанные со сбором, хранением, распространением и защитой информации о Пользователях, регулируются настоящей Политикой и действующим российским законодательством.</p>
        <p>2.4. Оператор вправе в любой момент вносить изменения в настоящую Политику. Обновленная версия Политики будет опубликована на Сайте. Рекомендуется регулярно проверять актуальность Политики.</p>
        <p>2.5. Пользователь выражает согласие с условиями настоящей Политики при использовании Сайта.</p>
      </section>

      <section>
        <h2>3. Условия использования Сайта</h2>
        <p>3.1. Пользователь, заполняя форму на Сайте, подтверждает, что он ознакомлен с настоящей Политикой и выражает согласие на обработку своих персональных данных в рамках целей, указанных в пункте 4.</p>
        <p>3.2. Оператор не проверяет достоверность предоставленных Пользователем данных.</p>
      </section>

      <section>
        <h2>4. Цель обработки информации</h2>
        <p>Оператор осуществляет обработку предоставленных Пользователем персональных данных для следующих целей:</p>
        <ul>
          <li>Обработка заявок на товары/услуги;</li>
          <li>Связь с Пользователем по вопросам исполнения заявки;</li>
          <li>Улучшение работы Сайта и обслуживания Пользователей.</li>
        </ul>
      </section>

      <section>
        <h2>5. Состав информации о Пользователях</h2>
        <p>Оператор обрабатывает следующие персональные данные Пользователя:</p>
        <ul>
          <li>Имя;</li>
          <li>Номер телефона;</li>
          <li>Электронная почта.</li>
        </ul>
      </section>

      <section>
        <h2>6. Обработка персональных данных</h2>
        <p>6.1. Оператор осуществляет обработку персональных данных на основании принципов:</p>
        <ul>
          <li>Законности целей и способов обработки;</li>
          <li>Согласия Пользователя на обработку персональных данных;</li>
          <li>Недопустимости объединения баз данных для несовместимых целей.</li>
        </ul>

        <p>6.2. Пользователь предоставляет Оператору согласие на обработку своих персональных данных при заполнении формы на Сайте и нажатии кнопки "Оставить заявку".</p>
        <p>6.3. Персональные данные не передаются третьим лицам, за исключением случаев, предусмотренных законодательством.</p>
        <p>6.4. Персональные данные Пользователя хранятся в течение 14 дней с момента их предоставления или до выполнения цели обработки.</p>
      </section>

      <section>
        <h2>7. Права и обязанности Пользователя</h2>
        <p>Пользователь вправе:</p>
        <ul>
          <li>Запрашивать информацию об обработке своих персональных данных у Оператора;</li>
          <li>Требовать исправления или удаления своих данных, если они являются неверными или обработка данных является незаконной.</li>
        </ul>
      </section>

      <section>
        <h2>8. Меры по защите информации</h2>
        <p>Оператор принимает необходимые технические и организационные меры для защиты персональных данных Пользователей от несанкционированного доступа, уничтожения, изменения, блокирования или распространения.</p>
      </section>

      <section>
        <h2>9. Обращения Пользователей</h2>
        <p>9.1. Пользователь вправе направить запросы к Оператору по вопросам использования своих персональных данных по адресу: Пермь, Тургенева, 21, или по электронной почте: podarokk.perm@gmail.com.</p>
        <p>9.2. Запрос должен содержать информацию, подтверждающую личность Пользователя и данные, предоставленные Оператору.</p>
        <p>9.3. Оператор обязуется рассмотреть запрос в течение 30 дней и предоставить ответ.</p>
        <p>9.4. Вся полученная информация от Пользователей является конфиденциальной и не раскрывается третьим лицам без письменного согласия Пользователя, за исключением случаев, предусмотренных законодательством.</p>
      </section>

      <section>
        <h2>10. Заключительные положения</h2>
        <p>Оператор обязуется соблюдать все необходимые меры для защиты персональных данных и информировать Пользователей о любых изменениях в Политике конфиденциальности.</p>
      </section>
    </div>
  </div>
</template>

<script>
export default {
  name: 'PrivacyPage',
  methods: {
    goBack() {
      this.$router.back();
    }
  }
}
</script>

<style scoped>
.PrivacyPage {
  min-height: 100vh;
  padding: 100px 20px 30px 20px;

  &__closeButton {
    position: absolute;
    left: -5px;
    top: 87px;
    display: inline-flex;
    align-items: center;
    justify-content: center;
    background: 0 0;
    width: 56px;
    height: 56px;
    cursor: pointer;
    z-index: 1;
  }
}

h1 {
  text-align: center;
  font-size: 24px;
  margin-bottom: 20px;
}

section {
  margin-bottom: 20px;
}

section h2 {
  font-size: 18px;
  margin-bottom: 10px;
}

ul {
  margin-left: 20px;
}

ul li {
  margin-bottom: 5px;
}

a {
  color: #007bff;
  text-decoration: none;
}

a:hover {
  text-decoration: underline;
}

@media (min-width: 1000px) {
  .PrivacyPage {
    padding: 120px 100px 0 100px;

    &__closeButton {
      left: 25px;
      top: 115px;
    }

    &__textBlock {
      margin-bottom: 32px;
    }
  }
}
</style>
